#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/prasheel-test-organization/gh-actions-demo/runs/run-GcYnarT3gsWu25AW

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
aws_ebs_volume.data-vol: Refreshing state... [id=vol-0de4b26e9d5bea794]
aws_s3_bucket.prasheel-test-bucket: Refreshing state... [id=my-tf-bucket-cloudfixlinter20221220112154851300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.data-vol will be created
  + resource "aws_ebs_volume" "data-vol" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = (known after apply)
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 1
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Owner"     = "prasheel.tiwari@trilogy.com"
          + "yor_trace" = "2e9ace76-9d14-4a56-8cf4-0a90393b5de6"
        }
      + throughput        = (known after apply)
      + type              = "gp2"
    }

  # aws_s3_bucket.prasheel-test-bucket will be created
  + resource "aws_s3_bucket" "prasheel-test-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "my-tf-bucket-cloudfixlinter"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Owner"     = "prasheel.tiwari@trilogy.com"
          + "yor_trace" = "1bf819f5-d130-4f67-810e-d6e24e32e125"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @prasheel-ti, Action: `pull_request`*